In [32]:
import pandas as pd

dataframe = pd.read_csv("C://Users//wkdal//Desktop//archive//titanic.csv")

dataframe.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [21]:
dataframe.iloc[1:4]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"

In [31]:
# 인덱스를 설정
dataframe = dataframe.set_index(dataframe['name'])

dataframe.loc['Allison, Mr. Hudson Joshua Creighton']

pclass                                        1.0
survived                                      0.0
name         Allison, Mr. Hudson Joshua Creighton
sex                                          male
age                                          30.0
sibsp                                         1.0
parch                                         2.0
ticket                                     113781
fare                                       151.55
cabin                                     C22 C26
embarked                                        S
boat                                          NaN
body                                        135.0
home.dest         Montreal, PQ / Chesterville, ON
Name: Allison, Mr. Hudson Joshua Creighton, dtype: object

구분               	loc[]	                           iloc[]
기준	                레이블(label) 기반	               정수(integer) 기반 인덱스
행 선택	            df.loc[3] → 인덱스가 '3'인 행 선택	   df.iloc[3] → 4번째 행 선택
열 선택	            df.loc[:, 'age'] → age 열 선택	   df.iloc[:, 2] → 3번째 열 선택
슬라이싱	            끝 포함 (inclusive)	               끝 제외 (exclusive, 파이썬 방식)
혼합	.               loc[행라벨, 열라벨]	               .iloc[행번호, 열번호]

In [35]:
dataframe[['sex','age']].head(10)

      sex      age
0  female  29.0000
1    male   0.9167
2  female   2.0000
3    male  30.0000
4  female  25.0000
5    male  48.0000
6  female  63.0000
7    male  39.0000
8  female  53.0000
9    male  71.0000

In [36]:
dataframe[ (dataframe['sex'] == 'female' ) & (dataframe['age'] >= 65 ) ]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
61,1.0,1.0,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1.0,0.0,19877,78.85,C46,S,6,NaN,"Little Onn Hall, Staffs"